# =============================================================================
# Unified Brewfile — MacBook + Mac Mini
# Generated: 2026-03-10
# =============================================================================

# Taps
tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "protonpass/tap"
tap "qmk/qmk"

# CLI Tools
brew "aider"
brew "cask"
brew "claude-code-templates"
brew "docker"
brew "fish"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "imagemagick"
brew "lazydocker"
brew "mackup"
brew "maigret"
brew "mark"
brew "matcha"
brew "node"
brew "pandoc"
brew "pdm"
brew "pipx"
brew "protonpass/tap/pass-cli"
brew "redis"
brew "rumdl"
brew "vibecheck"
brew "yt-dlp"

# GUI Apps
cask "1password"
cask "alfred"
cask "alt-tab"
cask "android-platform-tools"
cask "backdrop"
cask "balenaetcher"
cask "bartender"
cask "bitwarden"
cask "blip"
cask "block-goose"
cask "brave-browser"
cask "busycontacts"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "cursor"
cask "dash"
cask "discord"
cask "docker-desktop"
cask "dockflow"
cask "elecom-mouse-util"
cask "elgato-stream-deck"
cask "ente"
cask "figma"
cask "forklift"
cask "ghostty"
cask "git-credential-manager"
cask "glkvm"
cask "google-chrome"
cask "hyperwhisper"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jupyterlab-app"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "send-to-kindle"
cask "kitty"
cask "logi-options+"
cask "mcpbundler"
cask "mono-mdk-for-visual-studio"
cask "muteme"
cask "native-access"
cask "notion"
cask "obs"
cask "obsidian"
cask "plex"
cask "pocket-casts"
cask "proton-drive"
cask "protonvpn"
cask "proxyman"
cask "qmk-toolbox"
cask "raycast"
cask "secretive"
cask "signal"
cask "spotify"
cask "standard-notes"
cask "steam"
cask "sublime-text"
cask "swish"
cask "tailscale-app"
cask "thunderbird"
cask "ticktick"
cask "timing"
cask "tradingview"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "warp"
cask "whisky"
cask "wireshark-app"
cask "zoom"

# VS Code Extensions
vscode "ecmel.vscode-html-css"
vscode "github.codespaces"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
