tap "osx-cross/arm"
tap "osx-cross/avr"
tap "protonpass/tap"
tap "qmk/qmk"
brew "gcc"
brew "aider"
brew "node"
brew "bitwarden-cli"
brew "block-goose-cli"
brew "cask"
brew "claude-code-templates"
brew "docker"
brew "fish"
brew "fresh-editor"
brew "gh"
brew "ghostscript"
brew "icloudpd"
brew "imagemagick"
brew "lazydocker"
brew "mackup"
brew "maigret"
brew "mark"
brew "matcha"
brew "pandoc"
brew "pdm"
brew "pipx"
brew "redis"
brew "rumdl"
brew "strands-agents-sops"
brew "syncthing", restart_service: :changed
brew "telnet"
brew "vibecheck"
brew "weechat"
brew "yt-dlp"
brew "protonpass/tap/pass-cli"
cask "1password"
cask "1password-cli"
cask "adobe-digital-editions"
cask "alfred"
cask "anaconda"
cask "android-platform-tools"
cask "antigravity"
cask "arc"
cask "backblaze"
cask "backdrop"
cask "balenaetcher"
cask "bartender"
cask "beamer"
cask "bitwarden"
cask "blip"
cask "block-goose"
cask "brave-browser"
cask "calibre"
cask "chatgpt"
cask "claude-code"
cask "cleanshot"
cask "crossover"
cask "dash"
cask "discord"
cask "docker-desktop"
cask "dockflow"
cask "dockmate"
cask "elecom-mouse-util"
cask "element"
cask "elgato-stream-deck"
cask "figma"
cask "firefox"
cask "forklift"
cask "ghostty"
cask "git-credential-manager"
cask "gitbutler"
cask "glkvm"
cask "google-chrome"
cask "handbrake-app"
cask "hyperwhisper"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jupyterlab-app"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kindle"
cask "kiro"
cask "kitty"
cask "libreoffice"
cask "logi-options+"
cask "logitech-options"
cask "logitech-unifying"
cask "macforge"
cask "mcpbundler"
cask "microsoft-edge"
cask "mono-mdk-for-visual-studio"
cask "native-access"
cask "nessie-app"
cask "notion"
cask "obs"
cask "parallels"
cask "plex"
cask "pocket-casts"
cask "proton-pass"
cask "protonvpn"
cask "proxyman"
cask "qmk-toolbox"
cask "raindropio"
cask "raycast"
cask "rectangle-pro"
cask "secretive"
cask "signal"
cask "slack"
cask "spotify"
cask "standard-notes"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "superset"
cask "swish"
cask "tabby"
cask "teamviewer"
cask "telegram"
cask "thunderbird"
cask "timing"
cask "tower"
cask "tradingview"
cask "transmission"
cask "tuta-mail"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "warp"
cask "whisky"
cask "wireshark-app"
cask "zoom"
