tap "protonpass/tap"
brew "fish"
brew "mackup"
brew "node"
brew "syncthing", restart_service: :changed
brew "protonpass/tap/pass-cli"
cask "1password"
cask "alfred"
cask "alt-tab"
cask "bartender"
cask "bitwarden"
cask "blip"
cask "block-goose"
cask "brave-browser"
cask "busycontacts"
cask "calibre"
cask "claude"
cask "claude-code"
cask "cleanshot"
cask "cursor"
cask "dash"
cask "discord"
cask "dockdoor"
cask "docker-desktop"
cask "elecom-mouse-util"
cask "elgato-stream-deck"
cask "ente"
cask "forklift"
cask "iterm2"
cask "logi-options+"
cask "muteme"
cask "native-access"
cask "notion"
cask "obs"
cask "obsidian"
cask "pocket-casts"
cask "proton-drive"
cask "secretive"
cask "signal"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "tailscale-app"
cask "ticktick"
cask "timing"
cask "tradingview"
cask "transmission"
cask "vivaldi"
cask "warp"
